# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Core utilities
brew "tmux"
brew "neovim"
brew "ripgrep"
brew "gh"
brew "wget"

# Fonts
brew "font-jetbrains-mono-nerd-font"
brew "font-ia-writer-quattro"

# File handling
brew "gifsicle"
brew "ffmpeg"
brew "imagemagick"
brew "pngquant"

# Modern nix alternatives
brew "dog"
brew "httpie"
brew "lazygit"

# Web development
brew "deno"
brew "postgresql"
# brew "redis"

# Apps
cask "obsidian"
