# Core utilities
brew "fish"
brew "starship"

# CLI tools
brew "neovim"
brew "lazygit"
brew "ripgrep"
brew "zoxide"
brew "bat"
brew "gh"
brew "volta"

# Desktop apps
cask "wezterm"
cask "raycast"
cask "obsidian"

# Fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"
cask "font-ia-writer-quattro"

# Just experimenting with
cask "wezterm"
tap  "koekeishiya/formulae"
brew "yabai"
brew "skhd"
brew "tmux"
brew "fzf"
