# Core utilities
brew "starship"

# CLI tools
brew "neovim"
brew "lazygit"
brew "ripgrep"
brew "zoxide"
brew "bat"
brew "gh"
brew "ffmpeg"

# Desktop apps
cask "ghostty"
cask "raycast"
cask "obsidian"
cask "1password-cli"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-ia-writer-quattro"

# Terminal multiplexing
brew "tmux"
brew "fzf"
